local addon, ns = ...

-- 由当前职业 class/*.lua 覆盖填充
Fuyutsui.spellsList = {}

-- 英雄天赋
Fuyutsui.heroTalents = {
    -- 战士
    [436358] = 1,  -- 巨神兵
    [444767] = 2,  -- 屠戮者
    [434969] = 3,  -- 山丘领主
    -- 圣骑士
    [431377] = 1,  -- 烈日先驱
    [432459] = 2,  -- 铸光者
    [432472] = 2,  -- 铸光者
    [427445] = 3,  -- 圣殿骑士
    -- 猎人
    [466930] = 1,  -- 黑暗游侠
    [466932] = 1,  -- 黑暗游侠
    [471876] = 2,  -- 猎群领袖
    [1253599] = 3, -- 哨兵
    -- 盗贼
    [457052] = 1,  -- 死亡猎手
    [452536] = 2,  -- 命缚者
    [441146] = 3,  -- 欺诈者
    -- 牧师
    [1248423] = 1, -- 神谕者
    [263165] = 2,  -- 虚空编织者
    [447444] = 2,  -- 虚空编织者
    [120517] = 3,  -- 执政官
    [102644] = 3,  -- 执政官
    -- 死亡骑士
    [439843] = 1,  -- 死亡使者
    [433901] = 2,  -- 萨莱因
    [444005] = 3,  -- 天启骑士
    -- 萨满祭司
    [443450] = 1,  -- 先知
    [454009] = 2,  -- 风暴使者
    [444995] = 3,  -- 图腾祭祀
    [445024] = 3,  -- 图腾祭祀
    -- 法师
    [443739] = 1,  -- 疾咒师
    [448601] = 2,  -- 日怒
    [431044] = 3,  -- 霜火
    -- 术士
    [445486] = 1,  -- 地狱召唤者
    [449614] = 2,  -- 灵魂收割者
    [428514] = 3,  -- 恶魔使徒
    -- 武僧
    [450508] = 1,  -- 祥和宗师
    [450615] = 2,  -- 影踪派
    [443028] = 3,  -- 天神御师
    [123904] = 3,  -- 天神御师
    -- 德鲁伊
    [424058] = 1,  -- 艾露恩钦选者
    [433831] = 2,  -- 丛林守护者
    [441583] = 3,  -- 利爪德鲁伊
    [439528] = 4,  -- 荒野追猎者
    -- 恶魔猎手
    [442290] = 1,  -- 奥达奇收割者
    [452402] = 2,  -- 邪痕枭雄
    [1253304] = 3, -- 歼灭者
    -- 唤魔师
    [1264269] = 1, -- 塑焰者
    [436335] = 2,  -- 鳞长
    [438587] = 2,  -- 鳞长
    [431442] = 2,  -- 时空守卫
}

-- 难度文本
Fuyutsui.difficultyToText = {
    [1] = "5人本普通", -- Normal (Dungeon)
    [2] = "5人本英雄", -- Heroic (Dungeon)
    [14] = "团本普通", -- Normal (Raid)
    [15] = "团本英雄", -- Heroic (Raid)
    [16] = "团本史诗", -- Mythic (Raid)
    [17] = "团本随机", -- Looking (Raid)
    [23] = "5人本史诗", -- Mythic (Dungeon)
}
-- 首领ID
Fuyutsui.bossID = {
    [0] = 0,     -- 未战斗
    -- 虚影尖塔
    [3176] = 1,  -- 元首阿福扎恩
    [3177] = 2,  -- 弗拉希乌斯
    [3179] = 3,  -- 陨落之王萨哈达尔
    [3178] = 4,  -- 威厄高尔和艾佐拉克
    [3180] = 5,  -- 光盲先锋军
    [3181] = 6,  -- 宇宙之冕
    [3306] = 7,  -- 奇美鲁斯，未梦之神
    [3182] = 8,  -- 贝洛朗，奥的子嗣
    [3183] = 9,  -- 至暗之夜降临
    [3454] = 10, -- 鲁阿夏尔
    [3459] = 11, -- 索姆贝兰
    [3431] = 12, -- 普雷达萨斯
    [3436] = 13, -- 克拉格平
    -- 孢陨幽境
    [3159] = 14, -- 腐沼
    -- 潮缚石窟
    [3379] = 15, -- 尼姆瑞莎·唤波者
    -- 烈毒之渊
    [3470] = 16, -- 盘魂者内克扎莉
    [3445] = 17, -- 陵寝哨兵
    [3497] = 18, -- 迷失的探险者
    [3455] = 19, -- 万毒邪祟者瓦什尼克
    [3420] = 20, -- 斯索拉克
    [3421] = 21, -- 双子毒牙
    [3429] = 22, -- 盘卷祭坛
    [3492] = 23, -- 乌拉特克

    -- 大米
    -- 节点希纳斯
    [3328] = 51, -- 核技工程长卡斯雷瑟
    [3332] = 52, -- 核心守卫奈萨拉
    [3333] = 53, -- 洛萨克森
    -- 迈萨拉洞窟
    [3212] = 54, -- 姆罗金和内克拉克斯
    [3213] = 55, -- 沃达扎
    [3214] = 56, -- 拉克图尔，聚魂之器
    -- 风行者之塔
    [3056] = 57, -- 烬晓
    [3057] = 58, -- 被遗弃的二人组
    [3058] = 59, -- 指挥官克罗鲁科
    [3059] = 60, -- 无眠之心
    -- 魔导师平台
    [3071] = 61, -- 奥能金刚库斯托斯
    [3072] = 62, -- 瑟拉奈尔·日鞭
    [3073] = 63, -- 吉美尔鲁斯
    [3074] = 64, -- 迪詹崔乌斯
    -- 执政团之座
    [2065] = 65, -- 晋升者祖拉尔
    [2066] = 66, -- 萨普瑞什
    [2067] = 67, -- 总督奈扎尔
    [2068] = 68, -- 鲁拉
    -- 艾杰斯亚学院
    [2562] = 69, -- 维克萨姆斯
    [2563] = 70, -- 茂林古树
    [2564] = 71, -- 克罗兹
    [2565] = 72, -- 多拉苟萨的回响
    -- 萨隆矿坑
    [1999] = 73, -- 熔炉之主加弗斯特
    [2001] = 74, -- 伊克和科瑞克
    [2000] = 75, -- 天灾领主泰兰努斯
    -- 通天峰
    [1698] = 76, -- 兰吉特
    [1699] = 77, -- 阿拉卡纳斯
    [1700] = 78, -- 鲁克兰
    [1701] = 79, -- 高阶贤者维里克斯
    -- 毒牙祭坛
    [3456] = 80, -- 拉维
    [3457] = 81, -- 扭缠盘蛇
    [3458] = 82, -- 祖尔加
    -- 纳洛拉克的洞穴
    [3207] = 83, -- 囤宝狂人
    [3208] = 84, -- 寒冬哨兵
    [3209] = 85, -- 纳洛拉克
    -- 密谋小径
    [3101] = 86, -- 凯斯媞亚·魔力之心
    [3102] = 87, -- 赞恩·刃悲
    [3103] = 88, -- 歼灭者萨祖克斯
    [3105] = 89, -- 利希尔·烬怒
    -- 夺目谷
    [3199] = 90, -- 光明众花
    [3200] = 91, -- 圣光猎手伊库兹
    [3201] = 92, -- 护光者鲁伊亚
    [3202] = 93, -- 兹欧凯特
    -- 诸王之眠
    [2139] = 94, -- 黄金风蛇
    [2140] = 95, -- 部族议会
    [2142] = 96, -- 殓尸者姆沁巴
    [2143] = 97, -- 达萨大王
    -- 红玉新生法池
    [2609] = 98, -- 梅莉杜莎·寒妆
    [2606] = 99, -- 柯姬雅·焰蹄
    [2623] = 100, -- 基拉卡与厄克哈特·风脉
    -- 虚空之痕竞技场
    [3285] = 101, -- 塔兹拉尔
    [3286] = 102, -- 阿特洛苏斯
    [3287] = 103, -- 煞戎努斯
    -- 塞塔里斯神庙
    [2124] = 104, -- 阿德里斯和阿斯匹克斯
    [2125] = 105, -- 米利克萨
    [2126] = 106, -- 加瓦兹特
    [2127] = 107, -- 塞塔里斯的化身
}
-- 能量类型
Fuyutsui.EnumPowerType = {
    ["MANA"] = 0,
    ["RAGE"] = 1,
    ["FOCUS"] = 2,
    ["ENERGY"] = 3,
    ["COMBO_POINTS"] = 4,
    ["RUNES"] = 5,
    ["RUNIC_POWER"] = 6,
    ["SOUL_SHARDS"] = 7,
    ["LUNAR_POWER"] = 8,
    ["HOLY_POWER"] = 9,
    ["MAELSTROM"] = 11,
    ["CHI"] = 12,
    ["INSANITY"] = 13,
    ["BURNING_EMBERS"] = 14,
    ["DEMONIC_FURY"] = 15,
    ["ARCANE_CHARGES"] = 16,
    ["FURY"] = 17,
    ["PAIN"] = 18,
    ["ESSENCE"] = 19,
    ["SHADOW_ORBS"] = 28,
}
-- 专精范围
Fuyutsui.rangeSpecID = {
    -- Death Knight
    [250] = 15,  -- 鲜血
    [251] = 15,  -- 冰霜
    [252] = 15,  -- 邪恶
    [1455] = 15, -- Initial
    -- Demon Hunter
    [577] = 15,  -- 浩劫
    [581] = 15,  -- 复仇
    [1480] = 25, -- 噬灭
    [1456] = 15, -- Initial
    -- Druid
    [102] = 46,  -- 平衡
    [103] = 15,  -- 野性
    [104] = 15,  -- 守护
    [105] = 46,  -- 恢复
    [1447] = 15, -- Initial
    -- Evoker
    [1467] = 30, -- 湮灭
    [1468] = 30, -- 恩护
    [1473] = 30, -- 增辉
    [1465] = 15, -- Initial
    -- Hunter
    [253] = 46,  -- 兽王
    [254] = 46,  -- 射击
    [255] = 15,  -- 生存
    [1448] = 15, -- Initial
    -- Mage
    [62] = 46,   -- 奥术
    [63] = 46,   -- 火焰
    [64] = 46,   -- 冰霜
    [1449] = 15, -- Initial
    -- Monk
    [268] = 10,  -- 酒仙
    [270] = 10,  -- 织雾
    [269] = 10,  -- 踏风
    [1450] = 10, -- Initial
    -- Paladin
    [65] = 30,   -- 神圣
    [66] = 25,   -- 防护
    [70] = 30,   -- 惩戒
    [1451] = 25, -- Initial
    -- Priest
    [256] = 46,  -- 戒律
    [257] = 46,  -- 神圣
    [258] = 46,  -- 暗影
    [1452] = 46, -- Initial
    -- Rogue
    [259] = 15,  -- 刺杀
    [260] = 15,  -- 狂徒
    [261] = 15,  -- 敏锐
    [1453] = 15, -- Initial
    -- Shaman
    [262] = 46,  -- 元素
    [263] = 15,  -- 增强
    [264] = 46,  -- 恢复
    [1444] = 46, -- Initial
    -- Warlock
    [265] = 46,  -- 痛苦
    [266] = 46,  -- 恶魔
    [267] = 46,  -- 毁灭
    [1454] = 46, -- Initial
    -- Warrior
    [71] = 15,   -- 武器
    [72] = 15,   -- 狂怒
    [73] = 15,   -- 防护
    [1446] = 15, -- Initial
}
-- 动作条
Fuyutsui.actionBars = {
    { startSlot = 1,   endSlot = 12,  bindingPrefix = "ACTIONBUTTON" },
    { startSlot = 13,  endSlot = 24,  bindingPrefix = "ACTIONBUTTON" },
    { startSlot = 25,  endSlot = 36,  bindingPrefix = "MULTIACTIONBAR3BUTTON" },
    { startSlot = 37,  endSlot = 48,  bindingPrefix = "MULTIACTIONBAR4BUTTON" },
    { startSlot = 49,  endSlot = 60,  bindingPrefix = "MULTIACTIONBAR2BUTTON" },
    { startSlot = 61,  endSlot = 72,  bindingPrefix = "MULTIACTIONBAR1BUTTON" },
    { startSlot = 73,  endSlot = 84,  bindingPrefix = "ACTIONBUTTON" }, -- 战斗姿态, 猫形态, 潜行, 暗影
    { startSlot = 85,  endSlot = 96,  bindingPrefix = "ACTIONBUTTON" }, -- 防御姿态,
    { startSlot = 97,  endSlot = 108, bindingPrefix = "ACTIONBUTTON" }, -- 狂暴姿态, 熊形态
    { startSlot = 109, endSlot = 120, bindingPrefix = "ACTIONBUTTON" }, -- 枭兽形态
    { startSlot = 121, endSlot = 143, bindingPrefix = "ACTIONBUTTON" },
    { startSlot = 145, endSlot = 156, bindingPrefix = "MULTIACTIONBAR5BUTTON" },
    { startSlot = 157, endSlot = 168, bindingPrefix = "MULTIACTIONBAR6BUTTON" },
    { startSlot = 169, endSlot = 180, bindingPrefix = "MULTIACTIONBAR7BUTTON" }
}
-- 按键映射
Fuyutsui.keymap = {
    ["1"] = 49,
    ["2"] = 50,
    ["3"] = 51,
    ["4"] = 52,
    ["5"] = 53,
    ["6"] = 54,
    ["7"] = 55,
    ["8"] = 56,
    ["9"] = 57,
    ["0"] = 48,

    ["F1"] = 112,
    ["F2"] = 113,
    ["F3"] = 114,
    ["F4"] = 115,
    ["F5"] = 116,
    ["F6"] = 117,
    ["F7"] = 118,
    ["F8"] = 119,
    ["F9"] = 120,
    ["F10"] = 121,
    ["F11"] = 122,
    ["F12"] = 123,

    ["Q"] = 81,
    ["W"] = 87,
    ["E"] = 69,
    ["R"] = 82,
    ["T"] = 84,
    ["Y"] = 89,
    ["U"] = 85,
    ["I"] = 73,
    ["O"] = 79,
    ["P"] = 80,
    ["A"] = 65,
    ["S"] = 83,
    ["D"] = 68,
    ["F"] = 70,
    ["G"] = 71,
    ["H"] = 72,
    ["J"] = 74,
    ["K"] = 75,
    ["L"] = 76,
    ["Z"] = 90,
    ["X"] = 88,
    ["C"] = 67,
    ["V"] = 86,
    ["B"] = 66,
    ["N"] = 78,
    ["M"] = 77,

    ["NUMPAD0"] = 96,
    ["NUMPAD1"] = 97,
    ["NUMPAD2"] = 98,
    ["NUMPAD3"] = 99,
    ["NUMPAD4"] = 100,
    ["NUMPAD5"] = 101,
    ["NUMPAD6"] = 102,
    ["NUMPAD7"] = 103,
    ["NUMPAD8"] = 104,
    ["NUMPAD9"] = 105,
    ["NUMPADMULTIPLY"] = 106,
    ["NUMPADPLUS"] = 107,
    ["NUMPADMINUS"] = 109,
    ["NUMPADDECIMAL"] = 110,
    ["NUMPADDIVIDE"] = 111,

    ["N0"] = 96,  -- 0x60
    ["N1"] = 97,  -- 0x61
    ["N2"] = 98,  -- 0x62
    ["N3"] = 99,  -- 0x63
    ["N4"] = 100, -- 0x64
    ["N5"] = 101, -- 0x65
    ["N6"] = 102, -- 0x66
    ["N7"] = 103, -- 0x67
    ["N8"] = 104, -- 0x68
    ["N9"] = 105, -- 0x69
    ["N*"] = 106, -- 0x6A
    ["N+"] = 107, -- 0x6B
    ["N-"] = 109, -- 0x6D
    ["N."] = 110, -- 0x6E
    ["N/"] = 111, -- 0x6F

    ["SPACE"] = 32,
    ["="] = 187,
    ["EQUALS"] = 187, -- WoW可能返回EQUALS而不是=
    ["-"] = 189,
    ["MINUS"] = 189,  -- WoW可能返回MINUS而不是-
    ["["] = 219,
    ["]"] = 221,
    ["\\"] = 220,
    [";"] = 186,
    ["SEMICOLON"] = 186, -- WoW可能返回SEMICOLON而不是;
    ["'"] = 222,
    [","] = 188,
    ["COMMA"] = 188,  -- WoW可能返回COMMA而不是,
    ["."] = 190,
    ["PERIOD"] = 190, -- WoW可能返回PERIOD而不是.
    ["/"] = 191,
    ["INSERT"] = 45,
    ["DELETE"] = 46,
    ["HOME"] = 36,
    ["END"] = 35,
    ["PAGEUP"] = 33,
    ["PAGEDOWN"] = 34,
    ["LEFT"] = 37,
    ["UP"] = 38,
    ["RIGHT"] = 39,
    ["DOWN"] = 40,
}
-- 角色类型映射
Fuyutsui.roleMap = {
    ["TANK"] = 1,
    ["HEALER"] = 2,
    ["DAMAGER"] = 3,
    ["NONE"] = 0,
}
